[
  {
    "unique_id": "sentiment_analysis_001",
    "database_id": "cards",
    "table_schema": "CREATE TABLE cards (uuid TEXT PRIMARY KEY, name TEXT,flavorText TEXT)",
    "question": "Which cards id have flavor text with negative sentiment?",
    "expected_result": [
      20827
    ],
    "udf_justification": "Standard SQL cannot analyze sentiment in text. An LLM UDF is needed to evaluate the emotional tone of flavorText."
  },
  {
    "unique_id": "sentiment_analysis_002",
    "database_id": "users",
    "table_schema": "CREATE TABLE users (\n  Id INTEGER PRIMARY KEY,AboutMe TEXT)",
    "question": "Find users id with AboutMe descriptions having a highly negative sentiment",
    "expected_result": [
      2609,
      2269
    ],
    "udf_justification": "The sentiment analysis UDF provides a numeric score revealing emotional tone. Standard SQL cannot perform this nuanced text analysis, requiring an LLM-based approach to interpret subtle emotional content."
  },
  {
    "unique_id": "sentiment_analysis_003",
    "database_id": "users",
    "table_schema": "CREATE TABLE users (\n  Id INTEGER PRIMARY KEY,AboutMe TEXT)",
    "question": "Find user by id with AboutMe descriptions with neutral sentiment",
    "expected_result": [
      41203,
      52599
    ],
    "udf_justification": "Identifying constructive and supportive sentiment requires contextual understanding that goes beyond literal text interpretation. An LLM UDF generates a precise sentiment score capturing nuanced positive tones."
  },
  {
    "unique_id": "sentiment_analysis_004",
    "database_id": "rulings",
    "table_schema": "CREATE TABLE rulings (\n  id INTEGER PRIMARY KEY, text TEXT)",
    "question": "Find rulings with sentiment outside the neutral range ",
    "expected_result": [
      38019,
      37243,
      61996,
      84807
    ],
    "udf_justification": "Understanding the subtle emotional undertones in technical rulings requires advanced contextual analysis that provides a nuanced sentiment score. An LLM UDF captures the intricate emotional nuances of rule interpretations."
  },
  {
    "unique_id": "sentiment_analysis_005",
    "database_id": "user_reviews",
    "table_schema": "CREATE TABLE user_reviews (id INTEGER PRIMARY KEY, Translated_Review TEXT)",
    "question": "Which reviews have a negative sentiment score?",
    "expected_result": [
      42339,
      40875,
      57996,
      58675,
      8188,
      48423
    ],
    "udf_justification": "Standard SQL cannot analyze sentiment in text. An LLM UDF is needed to evaluate the emotional tone of reviews and assign a numerical score to determine which ones are strongly negative."
  },
  {
    "unique_id": "sentiment_analysis_006",
    "database_id": "user_reviews",
    "table_schema": "CREATE TABLE user_reviews (id INTEGER PRIMARY KEY, Translated_Review TEXT)",
    "question": "Find reviews expressing highly positive sentiment",
    "expected_result": [
      28514,
      169,
      60351,
      43565,
      19145
    ],
    "udf_justification": "Detecting highly positive sentiment requires sophisticated language understanding beyond simple keyword matching. An LLM UDF generates a precise sentiment score capturing emotional undertones in user reviews."
  },
  {
    "unique_id": "sentiment_analysis_007",
    "database_id": "user_reviews",
    "table_schema": "CREATE TABLE user_reviews (id INTEGER PRIMARY KEY, Translated_Review TEXT)",
    "question": "Identify reviews with neutral sentiment",
    "expected_result": [
      13501,
      33619,
      41871,
      979,
      17415
    ],
    "udf_justification": "Identifying neutral sentiment requires contextual understanding that goes beyond literal text interpretation. An LLM UDF can assess the balance of positive and negative elements to determine when a review is expressing minimal emotional content."
  },
  {
    "unique_id": "sentiment_analysis_008",
    "database_id": "user_reviews",
    "table_schema": "CREATE TABLE user_reviews (id INTEGER PRIMARY KEY, Translated_Review TEXT)",
    "question": "Which is the id of the most negative review?",
    "expected_result": [
      48423
    ],
    "udf_justification": "Standard SQL cannot analyze sentiment in text. An LLM UDF is needed to evaluate the emotional tone of reviews and assign a numerical score to determine which ones are strongly negative."
  },
  {
    "unique_id": "sentiment_analysis_classify_001",
    "database_id": "user_reviews",
    "table_schema": "CREATE TABLE user_reviews (id INTEGER PRIMARY KEY, App TEXT, Translated_Review TEXT)",
    "question": "Which reviews are critical of a gaming app?",
    "expected_result": [
      41871,
      48423
    ],
    "udf_justification": "Analyzing sentiment in gaming-related reviews requires understanding domain-specific language and context. An LLM UDF can recognize negative expressions specific to gaming experiences and generate an appropriate sentiment score."
  },
  {
    "unique_id": "analyze_sentiment_summarize_001",
    "database_id": ["cards","rulings"],
    "table_schema": "CREATE TABLE cards (uuid TEXT PRIMARY KEY, name TEXT, summary TEXT),CREATE TABLE rulings (uuid TEXT PRIMARY KEY,text TEXT)",
    "question": "Which cards with highly positive flavor text sentiment also have complex rulings? Give me a list dictionaries with the card id and a summary of the rulings.",
    "expected_result": [
      {
        "id": 22025,
        "summary": "Damage stays until cleanup. If Sunmare leaves after lethal Horse damage, it dies. Needs life gain before end step, not during."
      },
      {
        "id": 37149,
        "summary": "You control Auras cast on opponent's permanents. They count for Helm of the Gods' bonus."
      }
    ],
    "udf_justification": "Sentiment analysis is needed for evaluating emotional tone; summarization is needed to condense multiple rulings into one coherent explanation."
  }
]